; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v11 ?v4)
             (pred_9 ?v12 ?v5)
             (pred_12 ?v11 ?v5)
             (pred_6 ?v10 ?v11 )
	     (pred_5 ?v11)
             (pred_11 ?v2)
             (pred_3 ?v12)
             (pred_7 ?v5)
             (pred_8 ?v11)
             (pred_1 ?v12)
             (pred_10 ?v11)
             (pred_4 ))



(:action op_5
:parameters (?v9 ?v8 ?v6 ?v13)
:precondition (and (pred_11 ?v9) (pred_11 ?v8) (pred_3 ?v6) (pred_7 ?v13)
          (pred_2 ?v9 ?v8) (pred_9 ?v6 ?v13)
                   (pred_12 ?v8 ?v13) (pred_5 ?v9) 
                   (pred_8 ?v8) (pred_1 ?v6))
:effect (and  (pred_10 ?v8) (not (pred_8 ?v8))))


(:action op_2
:parameters (?v9 ?v1)
:precondition (and (pred_11 ?v9) (pred_11 ?v1)
               (pred_5 ?v9) (pred_2 ?v9 ?v1) (pred_10 ?v1))
:effect (and (pred_5 ?v1) (not (pred_5 ?v9))))

(:action op_4
:parameters (?v9 ?v6)
:precondition (and (pred_11 ?v9) (pred_3 ?v6) 
                  (pred_5 ?v9) (pred_6 ?v6 ?v9) (pred_4 ))
:effect (and (pred_1 ?v6)
   (not (pred_6 ?v6 ?v9)) (not (pred_4 ))))


(:action op_1
:parameters (?v9 ?v7 ?v3)
:precondition (and (pred_11 ?v9) (pred_3 ?v7) (pred_3 ?v3)
                  (pred_5 ?v9) (pred_1 ?v3) (pred_6 ?v7 ?v9))
:effect (and (pred_1 ?v7) (pred_6 ?v3 ?v9)
        (not (pred_1 ?v3)) (not (pred_6 ?v7 ?v9))))

(:action op_3
:parameters (?v9 ?v6)
:precondition (and (pred_11 ?v9) (pred_3 ?v6) 
                  (pred_5 ?v9) (pred_1 ?v6))
:effect (and (pred_4 ) (pred_6 ?v6 ?v9) (not (pred_1 ?v6)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_08 obj_18 obj_19 obj_03 obj_09 obj_01 obj_16 obj_04 obj_10 obj_17 obj_02 obj_20 obj_07 obj_21 obj_11 obj_13
    obj_12 obj_06 obj_05
    obj_15 obj_22 obj_14
    )

    (:init
       (pred_4)

       (pred_11 obj_08)
       (pred_11 obj_18)
       (pred_11 obj_19)
       (pred_11 obj_03)
       (pred_11 obj_09)
       (pred_11 obj_01)
       (pred_11 obj_16)
       (pred_11 obj_04)
       (pred_11 obj_10)
       (pred_11 obj_17)
       (pred_11 obj_02)
       (pred_11 obj_20)
       (pred_11 obj_07)
       (pred_11 obj_21)
       (pred_11 obj_11)
       (pred_11 obj_13)
       (pred_7 obj_12)
       (pred_7 obj_06)
       (pred_7 obj_05)
       (pred_3 obj_15)
       (pred_3 obj_22)
       (pred_3 obj_14)

       (pred_2 obj_08 obj_09)
       (pred_2 obj_08 obj_18)
       (pred_2 obj_18 obj_01)
       (pred_2 obj_18 obj_19)
       (pred_2 obj_18 obj_08)
       (pred_2 obj_19 obj_16)
       (pred_2 obj_19 obj_03)
       (pred_2 obj_19 obj_18)
       (pred_2 obj_03 obj_04)
       (pred_2 obj_03 obj_19)
       (pred_2 obj_09 obj_10)
       (pred_2 obj_09 obj_01)
       (pred_2 obj_09 obj_08)
       (pred_2 obj_01 obj_17)
       (pred_2 obj_01 obj_16)
       (pred_2 obj_01 obj_18)
       (pred_2 obj_01 obj_09)
       (pred_2 obj_16 obj_02)
       (pred_2 obj_16 obj_04)
       (pred_2 obj_16 obj_19)
       (pred_2 obj_16 obj_01)
       (pred_2 obj_04 obj_20)
       (pred_2 obj_04 obj_03)
       (pred_2 obj_04 obj_16)
       (pred_2 obj_10 obj_07)
       (pred_2 obj_10 obj_17)
       (pred_2 obj_10 obj_09)
       (pred_2 obj_17 obj_21)
       (pred_2 obj_17 obj_02)
       (pred_2 obj_17 obj_01)
       (pred_2 obj_17 obj_10)
       (pred_2 obj_02 obj_11)
       (pred_2 obj_02 obj_20)
       (pred_2 obj_02 obj_16)
       (pred_2 obj_02 obj_17)
       (pred_2 obj_20 obj_13)
       (pred_2 obj_20 obj_04)
       (pred_2 obj_20 obj_02)
       (pred_2 obj_07 obj_21)
       (pred_2 obj_07 obj_10)
       (pred_2 obj_21 obj_11)
       (pred_2 obj_21 obj_17)
       (pred_2 obj_21 obj_07)
       (pred_2 obj_11 obj_13)
       (pred_2 obj_11 obj_02)
       (pred_2 obj_11 obj_21)
       (pred_2 obj_13 obj_20)
       (pred_2 obj_13 obj_11)
       (pred_8 obj_04)
       (pred_8 obj_11)
       (pred_8 obj_13)
       (pred_12  obj_04 obj_12)
       (pred_12  obj_11 obj_06)
       (pred_12  obj_13 obj_05)
       (pred_10 obj_08)
       (pred_10 obj_18)
       (pred_10 obj_19)
       (pred_10 obj_03)
       (pred_10 obj_09)
       (pred_10 obj_01)
       (pred_10 obj_16)
       (pred_10 obj_10)
       (pred_10 obj_17)
       (pred_10 obj_02)
       (pred_10 obj_20)
       (pred_10 obj_07)
       (pred_10 obj_21)

       (pred_9  obj_15 obj_12)
       (pred_9  obj_22 obj_06)
       (pred_9  obj_14 obj_05)
       (pred_6 obj_15 obj_18)
       (pred_6 obj_22 obj_16)
       (pred_6 obj_14 obj_20)
       (pred_5 obj_21)
    )

    (:goal (and
       (pred_6 obj_15 obj_09)
       (pred_6 obj_14 obj_02)
    ))
(:constraints
  (always (not (pred_5 obj_17)))
)
)

; plan
1. (op_2 obj_21 obj_07)
   deleted: (pred_5 obj_21)
   added: (pred_5 obj_07)
   goals met: 0 of 2
2. (op_2 obj_07 obj_10)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_10)
   goals met: 0 of 2
3. (op_2 obj_10 obj_09)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_09)
   goals met: 0 of 2
4. (op_2 obj_09 obj_01)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_01)
   goals met: 0 of 2
5. (op_2 obj_01 obj_18)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_18)
   goals met: 0 of 2
6. (op_4 obj_18 obj_15)
   deleted: (pred_6 obj_15 obj_18) (pred_4)
   added: (pred_1 obj_15)
   goals met: 0 of 2
7. (op_2 obj_18 obj_01)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_01)
   goals met: 0 of 2
8. (op_2 obj_01 obj_09)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_09)
   goals met: 0 of 2
9. (op_3 obj_09 obj_15)
   deleted: (pred_1 obj_15)
   added: (pred_4) (pred_6 obj_15 obj_09)
   goals met: 1 of 2
10. (op_2 obj_09 obj_01)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_01)
   goals met: 1 of 2
11. (op_2 obj_01 obj_16)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_16)
   goals met: 1 of 2
12. (op_2 obj_16 obj_02)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_02)
   goals met: 1 of 2
13. (op_2 obj_02 obj_20)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_20)
   goals met: 1 of 2
14. (op_4 obj_20 obj_14)
   deleted: (pred_6 obj_14 obj_20) (pred_4)
   added: (pred_1 obj_14)
   goals met: 1 of 2
15. (op_2 obj_20 obj_02)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_02)
   goals met: 1 of 2
16. (op_3 obj_02 obj_14)
   deleted: (pred_1 obj_14)
   added: (pred_4) (pred_6 obj_14 obj_02)
   goals met: 2 of 2
